bitplane/nokia-dct3-re/driver/tms320c54x_test.cpp
	void program_map(address_map &map) ATTR_COLD
	{
		map(0x0000, 0xffff).ram();
	}

	void data_map(address_map &map) ATTR_COLD
	{
		map(0x0000, 0xffff).ram();
	}

	void rom4_program_map(address_map &map) ATTR_COLD
	{
		map(0x0000, 0xffff).rom().region("dspprg", 0);
	}

	void rom4_data_map(address_map &map) ATTR_COLD
	{
		map(0x0000, 0xffff).ram();
	}

	void expect(bool condition, const char *message)
	{
		if (!condition)
			throw emu_fatalerror("TMS320C54x core conformance: %s", message);
	}

	TIMER_CALLBACK_MEMBER(check_results)
	{
		auto &program = m_cpu->space(AS_PROGRAM);
		auto &data = m_cpu->space(AS_DATA);
		if (m_phase == 5)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE),
					"long-immediate RPT terminal IDLE3");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR0) == 3,
					"long-immediate RPT iteration count");
			 expect(data.read_word(0x090c) == 0x1234 &&
					data.read_word(0x090d) == 0,
					"long-immediate load and long-memory store");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0360);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST0, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_phase = 6;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 6)
		{
			expect(data.read_word(0x0910) == 0x5678,
					"absolute STM extension order");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR4) == 0xabcd,
					"data-memory to MMR move");
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) ==
					(0x12345678 ^ ((u64(1) << 40) - 1)),
					"absolute double-word load and accumulator complement");
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x00ff0f00,
					"shifted long-immediate accumulator XOR");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0370);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR0, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0x1234);
			m_phase = 7;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 7)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 0,
					"repeat-with-zero clears its accumulator");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR0) == 2,
					"repeat-with-zero iteration count");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0374);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR0, 0);
			m_phase = 8;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 8)
		{
			expect(data.read_word(0x091a) == 2,
					"memory-counted multiword repeat iteration count");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x037a);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR2, 0x0920);
			m_phase = 9;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 9)
		{
			osd_printf_info("TMS320C54x repeated MVDP result: %04x,%04x\n",
					m_cpu->space(AS_PROGRAM).read_word(0x0924),
					m_cpu->space(AS_PROGRAM).read_word(0x0925));
			expect(m_cpu->space(AS_PROGRAM).read_word(0x0924) == 0xaaaa &&
					m_cpu->space(AS_PROGRAM).read_word(0x0925) == 0xbbbb,
					"repeated MVDP advances its program destination");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0380);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 10;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 10)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0391,
					"delayed branch executes both delay-slot words");
			data.write_word(0x02ff, 0x0398);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0392);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x02ff);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0x0800);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 11;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 11)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0399 &&
					m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300 &&
					!(m_cpu->state_int(tms320c54x_device::STATE_ST1) & 0x0800),
					"interrupt return restores PC/SP and enables interrupts");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x039a);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 12;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 12)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x03a1,
					"delayed accumulator-equal branch");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03a2);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 13;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 13)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0xaaaa00,
					"extended absolute load with positive shift");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03a6);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0x03b0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 14;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 14)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x03b1,
					"accumulator-indirect branch");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03b2);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 5);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 15;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 15)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 4,
					"data-memory subtract from accumulator B");
			data.write_word(0x02ff, 0x03c0);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03b6);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x02ff);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, (u64(1) << 40) - 1);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 16;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 16)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x03c1 &&
					m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300,
					"conditional return on negative accumulator B");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03c2);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x0300);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 17;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 17)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x03d1 &&
					m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x02ff &&
					data.read_word(0x02ff) == 0x03c4,
					"conditional call on non-positive accumulator A");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03d2);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 3);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 9);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 18;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 18)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 6,
					"accumulator subtract with independent destination");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03d4);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x0940);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR2, 0x0920);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 19;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 19)
		{
			expect(m_cpu->space(AS_PROGRAM).read_word(0x0940) == 0xaaaa &&
					m_cpu->space(AS_PROGRAM).read_word(0x0941) == 0xbbbb,
					"repeated accumulator-addressed program write");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03d8);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR2, 0x0918);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 2);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 20;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 20)
		{
			expect((m_cpu->state_int(tms320c54x_device::STATE_ST1) & 0x1f) == 1,
					"data-memory load into ST1.ASM");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03da);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x0300);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 21;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 21)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0301,
					"signed stack-frame adjustment");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03e0);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x35);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 22;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 22)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x1a,
					"arithmetic accumulator shift right");
			program.write_word(0x03e4, 0x07f8); // ADDC *(absolute), B
			program.write_word(0x03e5, 0x0920);
			program.write_word(0x03e6, 0xf5e1);
			data.write_word(0x0920, 0xabcd);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03e4);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0x1234);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST0, 0x0800);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 23;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 23)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 0xbe02,
					"ADDC absolute operand and carry input");
			expect(!(m_cpu->state_int(tms320c54x_device::STATE_ST0) & 0x0800),
					"ADDC 32-bit carry output");
			program.write_word(0x03e8, 0x6e8f); // BANZD 03efh, *AR7-
			program.write_word(0x03e9, 0x03ef);
			program.write_word(0x03ea, 0xe801);
			program.write_word(0x03eb, 0xe902);
			program.write_word(0x03ec, 0xe803);
			program.write_word(0x03ef, 0xf5e1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03e8);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR7, 1);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 24;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 24)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 1 &&
					m_cpu->state_int(tms320c54x_device::STATE_B) == 2,
					"BANZD executes two delay words");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR7) == 0,
					"BANZD address-register modification");
			program.write_word(0x03f0, 0x24f8); // MPYU *(absolute), A
			program.write_word(0x03f1, 0x0922);
			program.write_word(0x03f2, 0xf5e1);
			data.write_word(0x0922, 2);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03f0);
			m_cpu->set_state_int(tms320c54x_device::STATE_T, 0xffff);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 25;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 25)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x1fffe,
					"MPYU unsigned operands");
			program.write_word(0x03f4, 0x31f8); // MPYA *(absolute)
			program.write_word(0x03f5, 0x0924);
			program.write_word(0x03f6, 0xf5e1);
			data.write_word(0x0924, 0xfffe);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03f4);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 3U << 16);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 26;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 26)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) ==
					((u64(1) << 40) - 6), "MPYA signed product");
			expect(m_cpu->state_int(tms320c54x_device::STATE_T) == 0xfffe,
					"MPYA loads T");
			program.write_word(0x03f8, 0xf944); // CC 0400h, ANEQ
			program.write_word(0x03f9, 0x0400);
			program.write_word(0x03fa, 0xf5e1);
			program.write_word(0x0400, 0xe85a);
			program.write_word(0x0401, 0xfc00);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x03f8);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x0300);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 1);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 27;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 27)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x5a,
					"conditional call ANEQ");
			expect(m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300,
					"conditional call return stack");
			program.write_word(0x0404, 0x7ef8); // READA *(absolute)
			program.write_word(0x0405, 0x0926);
			program.write_word(0x0406, 0x7ff8); // WRITA *(absolute)
			program.write_word(0x0407, 0x0927);
			program.write_word(0x0408, 0xf5e1);
			program.write_word(0x0925, 0xcafe);
			data.write_word(0x0927, 0xbeef);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0404);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x0925);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 28;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 28)
		{
			expect(data.read_word(0x0926) == 0xcafe,
					"READA accumulator-addressed data read");
			expect(program.read_word(0x0925) == 0xbeef,
					"WRITA accumulator-addressed data write");
			program.write_word(0x040c, 0xf485); // ABS A, A
			program.write_word(0x040d, 0xf5e1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x040c);
			m_cpu->set_state_int(tms320c54x_device::STATE_A,
					(u64(1) << 40) - 7);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 29;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 29)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 7,
					"ABS signed accumulator magnitude");
			program.write_word(0x0410, 0x1ef8); // SUBC *(absolute), A
			program.write_word(0x0411, 0x0928);
			program.write_word(0x0412, 0xf5e1);
			data.write_word(0x0928, 1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0410);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x10000);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST0, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 30;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 30)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x10001,
					"SUBC conditional subtract and quotient bit");
			expect(m_cpu->state_int(tms320c54x_device::STATE_ST0) & 0x0800,
					"SUBC successful subtraction carry");
			program.write_word(0x0414, 0x1092); // LD *AR2+, A
			program.write_word(0x0415, 0xf5e1);
			data.write_word(0x0930, 0x1234);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0414);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR2, 0x0930);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST0, 0xa000);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0x0000);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 31;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 31)
		{
			expect((m_cpu->state_int(tms320c54x_device::STATE_ST0) & 0xe000) == 0xa000,
					"standard-mode indirect operand preserves ST0.ARP");
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0414);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR2, 0x0930);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST0, 0xa000);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0x0020);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 32;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 32)
		{
			expect((m_cpu->state_int(tms320c54x_device::STATE_ST0) & 0xe000) == 0x4000,
					"compatibility-mode indirect operand updates ST0.ARP");
			program.write_word(0x0418, 0xf0b0); // OR A, -16, A
			program.write_word(0x0419, 0xf5e1);
			constexpr u64 negative = (u64(0xff) << 32) | 0x80000000U;
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0418);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, negative);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 33;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 33)
		{
			constexpr u64 negative = (u64(0xff) << 32) | 0x80000000U;
			osd_printf_info("TMS320C54x logical shift: actual=%010llx expected=%010llx\n",
					(unsigned long long)m_cpu->state_int(tms320c54x_device::STATE_A),
					(unsigned long long)((negative | (negative >> 16)) & ((u64(1) << 40) - 1)));
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) ==
					((negative | (negative >> 16)) & ((u64(1) << 40) - 1)),
					"logical accumulator right shift zero-fills guard bits");
			program.write_word(0x041c, 0xed18); // LD #-8, ASM
			program.write_word(0x041d, 0xf5e1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x041c);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0xa5a5);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 34;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 34)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_ST1) == 0xa5b8,
					"short-immediate load into ST1.ASM");
			program.write_word(0x0420, 0x771a); // STM #1, BRC
			program.write_word(0x0421, 0x0001);
			program.write_word(0x0422, 0xf272); // RPTBD 0428h
			program.write_word(0x0423, 0x0428);
			program.write_word(0x0424, 0xe801); // delay slot 1
			program.write_word(0x0425, 0xe902); // delay slot 2
			program.write_word(0x0426, 0x6d10); // MAR *AR0+
			program.write_word(0x0427, 0xf495);
			program.write_word(0x0428, 0xf495);
			program.write_word(0x0429, 0xf5e1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0420);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR0, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 35;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 35)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 1 &&
					m_cpu->state_int(tms320c54x_device::STATE_B) == 2,
					"RPTBD executes both delay slots once");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR0) == 2 &&
					m_cpu->state_int(tms320c54x_device::STATE_BRC) == 0 &&
					!(m_cpu->state_int(tms320c54x_device::STATE_ST1) & 0x4000),
					"RPTBD repeats its body and retires BRAF");
			program.write_word(0x042c, 0xa43a); // MPY *AR5, *AR4+, A
			program.write_word(0x042d, 0xf5e1);
			data.write_word(0x0940, 3);
			data.write_word(0x0950, 0xfffe);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x042c);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR4, 0x0940);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR5, 0x0950);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 36;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 36)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) ==
					((u64(1) << 40) - 6) &&
					m_cpu->state_int(tms320c54x_device::STATE_T) == 0xfffe,
					"dual-memory multiply result and T load");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR4) == 0x0941 &&
					m_cpu->state_int(tms320c54x_device::STATE_AR5) == 0x0950,
					"dual-memory multiply address updates");
			program.write_word(0x0430, 0xb336); // MAC *AR5, *AR4-, B, B
			program.write_word(0x0431, 0xf5e1);
			data.write_word(0x0941, 4);
			data.write_word(0x0950, 0xfffd);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0430);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR4, 0x0941);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR5, 0x0950);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 20);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 37;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 37)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 8 &&
					m_cpu->state_int(tms320c54x_device::STATE_T) == 0xfffd,
					"dual-memory signed multiply-accumulate");
			expect(m_cpu->state_int(tms320c54x_device::STATE_AR4) == 0x0940 &&
					m_cpu->state_int(tms320c54x_device::STATE_AR5) == 0x0950,
					"dual-memory MAC address updates");
			program.write_word(0x0434, 0xd631); // ST B,*AR3 || MACR *AR5,A
			program.write_word(0x0435, 0xf5e1);
			data.write_word(0x0950, 3);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0434);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR3, 0x0960);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR5, 0x0950);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x10001);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0x12345678);
			m_cpu->set_state_int(tms320c54x_device::STATE_T, 2);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 38;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 38)
		{
			expect(data.read_word(0x0960) == 0x1234,
					"parallel store uses the pre-accumulate source");
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x10000,
					"parallel rounded multiply-accumulate");
			program.write_word(0x0438, 0xe210); // SQDST *AR3,*AR2
			program.write_word(0x0439, 0xf5e1);
			data.write_word(0x0960, 5);
			data.write_word(0x0970, 8);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0438);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR2, 0x0970);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR3, 0x0960);
			m_cpu->set_state_int(tms320c54x_device::STATE_A,
					(u64(0xff) << 32) | (u64(0xfffe) << 16));
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 10);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 39;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 39)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) ==
					((u64(1) << 40) - 0x30000),
					"square-distance signed vector difference");
			expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 14,
					"square-distance accumulation of old A high half");
			program.write_word(0x043c, 0xfa44); // BCD 0442h, ANEQ
			program.write_word(0x043d, 0x0442);
			program.write_word(0x043e, 0xe802);
			program.write_word(0x043f, 0xe903);
			program.write_word(0x0440, 0xf5e1);
			program.write_word(0x0442, 0xf5e1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x043c);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 1);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 40;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 40)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE) &&
