bitplane/nokia-dct3-re/driver/tms320c54x_test.cpp
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0443 &&
					m_cpu->state_int(tms320c54x_device::STATE_A) == 2 &&
					m_cpu->state_int(tms320c54x_device::STATE_B) == 3,
					"delayed accumulator-not-equal branch and delay slots");
			program.write_word(0x0444, 0xf484); // NEG A
			program.write_word(0x0445, 0xf5e1);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0444);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 5);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST0, 0x0800);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 41;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 41)
		{
			expect(m_cpu->state_int(tms320c54x_device::STATE_A) ==
					((u64(1) << 40) - 5) &&
					!(m_cpu->state_int(tms320c54x_device::STATE_ST0) & 0x0800),
					"accumulator negate result and carry");
			program.write_word(0x0448, 0xf4e3); // CALA A
			program.write_word(0x0449, 0xf5e1);
			program.write_word(0x0450, 0x76f8);
			program.write_word(0x0451, 0x0944);
			program.write_word(0x0452, 0xbeef);
			program.write_word(0x0453, 0xfc00);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0448);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x0450);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x0300);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 42;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 42)
		{
			expect(data.read_word(0x0944) == 0xbeef &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x044a &&
					m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300,
					"CALA A target and return address");
			program.write_word(0x0460, 0xf5e3); // CALA B
			program.write_word(0x0461, 0xf5e1);
			program.write_word(0x0468, 0x76f8);
			program.write_word(0x0469, 0x0945);
			program.write_word(0x046a, 0xcafe);
			program.write_word(0x046b, 0xfc00);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0460);
			m_cpu->set_state_int(tms320c54x_device::STATE_B, 0x0468);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 43;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 43)
		{
			expect(data.read_word(0x0945) == 0xcafe &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0462 &&
					m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300,
					"CALA B target and return address");
			program.write_word(0x0470, 0xf6e3); // CALAD A
			program.write_word(0x0471, 0xe801);
			program.write_word(0x0472, 0xe902);
			program.write_word(0x0473, 0xf5e1);
			program.write_word(0x0478, 0x76f8);
			program.write_word(0x0479, 0x0946);
			program.write_word(0x047a, 0x1234);
			program.write_word(0x047b, 0xfc00);
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0470);
			m_cpu->set_state_int(tms320c54x_device::STATE_A, 0x0478);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_phase = 44;
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 44)
		{
			expect(data.read_word(0x0946) == 0x1234 &&
					m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0474 &&
					m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300 &&
					m_cpu->state_int(tms320c54x_device::STATE_A) == 1 &&
					m_cpu->state_int(tms320c54x_device::STATE_B) == 2,
					"CALAD delay slots and return address");
			osd_printf_info("TMS320C54x core conformance: PASS\n");
			throw emu_fatalerror(0, "TMS320C54x core tests complete");
		}
		if (m_phase == 4)
		{
			if (!m_cpu->state_int(tms320c54x_device::STATE_ILLEGAL) &&
					!m_cpu->state_int(tms320c54x_device::STATE_IDLE))
			{
				expect(++m_rom4_checks < 10000, "ROM4 cold execution timeout");
				m_check_timer->adjust(attotime::from_usec(100));
				return;
			}
			osd_printf_info("TMS320C54x ROM4 cold frontier: pc=%04x sp=%04x "
					"pmst=%04x idle=%u\n",
					u16(m_cpu->state_int(tms320c54x_device::STATE_PC)),
					u16(m_cpu->state_int(tms320c54x_device::STATE_SP)),
					u16(m_cpu->state_int(tms320c54x_device::STATE_PMST)),
					unsigned(m_cpu->state_int(tms320c54x_device::STATE_IDLE)));
			expect(m_cpu->state_int(tms320c54x_device::STATE_ILLEGAL),
					"ROM4 cold loader-upload boundary");
			expect(m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0f01,
					"ROM4 cold loader entry PC");
			expect(m_cpu->space(AS_PROGRAM).read_word(0x0f00) == 0,
					"ROM4 loader1 must be MCU-uploaded");
			throw emu_fatalerror(0, "TMS320C54x ROM4 cold frontier complete");
		}
		if (m_phase == 3)
		{
			if (!m_irq_raised)
			{
				expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE),
						"IDLE3 entry");
				expect(m_cpu->state_int(tms320c54x_device::STATE_PC) == 0x0401,
						"IDLE3 continuation PC");
				m_cpu->set_input_line(2, ASSERT_LINE);
				m_irq_raised = true;
				m_check_timer->adjust(attotime::from_usec(100));
				return;
			}
			expect(data.read_word(0x0a10) == 0xcafe,
					"maskable interrupt vector execution");
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE),
					"fast-interrupt return continuation");
			expect(m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300 &&
					!(m_cpu->state_int(tms320c54x_device::STATE_ST1) & 0x0800),
					"RETF restores the fast return and interrupt-mask state");
			m_cpu->set_input_line(2, CLEAR_LINE);
			m_phase = 1;
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0300);
			m_cpu->set_state_int(tms320c54x_device::STATE_SP, 0x0300);
			m_cpu->set_state_int(tms320c54x_device::STATE_ST1, 0x0100);
			m_cpu->set_state_int(tms320c54x_device::STATE_ILLEGAL, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}
		if (m_phase == 2)
		{
			if (!m_cpu->state_int(tms320c54x_device::STATE_ILLEGAL) &&
					!m_cpu->state_int(tms320c54x_device::STATE_IDLE))
			{
				expect(++m_rom4_checks < 10000,
						"ROM4 execution frontier timeout");
				m_check_timer->adjust(attotime::from_usec(100));
				return;
			}
			const u16 pc = m_cpu->state_int(tms320c54x_device::STATE_PC);
			static constexpr u16 expected_response[] = {
				0x3532, 0x0000, 0xffff, 0xffff, 0xff0f, 0x0000, 0x0078,
				0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x087c, 0x0000
			};
			osd_printf_info("TMS320C54x ROM4 execution frontier: pc=%04x "
					"header=%04x,%04x ar2=%04x ar3=%04x\n", pc,
					data.read_word(0x1200), data.read_word(0x1201),
					u16(m_cpu->state_int(tms320c54x_device::STATE_AR2)),
					u16(m_cpu->state_int(tms320c54x_device::STATE_AR3)));
			for (unsigned i = 0; i != std::size(expected_response); ++i)
			{
				const u16 observed = data.read_word(0x1200 + i);
				if (observed != expected_response[i])
					osd_printf_info("TMS320C54x ROM4 response mismatch word=%u actual=%04x expected=%04x\n",
							i, observed, expected_response[i]);
				expect(observed == expected_response[i],
						"complete ROM4 challenge response");
			}
			expect(m_cpu->state_int(tms320c54x_device::STATE_IDLE),
					"ROM4 DSP sleep boundary");
			// IDLE3 at 0x7ec9 advances PC before waiting for a wake source.
			expect(pc == 0x7eca, "ROM4 DSP sleep PC");
			throw emu_fatalerror(0, "TMS320C54x ROM4 frontier complete");
		}
		if (m_phase)
		{
			static constexpr u16 expected[] = {
				0x1cee, 0x7cb6, 0xd2a3, 0xb986, 0x4c57, 0xe65e
			};
			osd_printf_info("TMS320C54x transform result: %04x,%04x,%04x,%04x,%04x,%04x\n",
					data.read_word(0x1202), data.read_word(0x1203),
					data.read_word(0x1204), data.read_word(0x1205),
					data.read_word(0x1206), data.read_word(0x1207));
			for (unsigned i = 0; i != std::size(expected); ++i)
				expect(data.read_word(0x1202 + i) == expected[i],
						"ROM4 challenge transform terminal loop");
			expect(m_cpu->state_int(tms320c54x_device::STATE_BRC) == 0,
					"ROM4 challenge transform repeat count");
			m_phase = 5;
			m_cpu->set_state_int(tms320c54x_device::STATE_PC, 0x0350);
			m_cpu->set_state_int(tms320c54x_device::STATE_AR0, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_ILLEGAL, 0);
			m_cpu->set_state_int(tms320c54x_device::STATE_IDLE, 0);
			m_check_timer->adjust(attotime::from_usec(100));
			return;
		}

		osd_printf_info("TMS320C54x test state: pc=%04x sp=%04x brc=%04x "
				"rpt=%04x,%04x,%04x block=%04x,%04x,%04x\n",
				u16(m_cpu->state_int(tms320c54x_device::STATE_PC)),
				u16(m_cpu->state_int(tms320c54x_device::STATE_SP)),
				u16(m_cpu->state_int(tms320c54x_device::STATE_BRC)),
				data.read_word(0x0400), data.read_word(0x0401), data.read_word(0x0402),
				data.read_word(0x0600), data.read_word(0x0601), data.read_word(0x0602));
		expect(data.read_word(0x0700) == 0xbeef, "CALL/RET continuation");
		expect(m_cpu->state_int(tms320c54x_device::STATE_SP) == 0x0300,
				"balanced system stack");
		expect(data.read_word(0x0400) == 0x1111 &&
				data.read_word(0x0401) == 0x2222 &&
				data.read_word(0x0402) == 0x3333, "RPT memory transfer");
		expect(data.read_word(0x0600) == 0x1111 &&
				data.read_word(0x0601) == 0x2222 &&
				data.read_word(0x0602) == 0x3333, "RPTB multiword CALL");
		expect(m_cpu->state_int(tms320c54x_device::STATE_BRC) == 0,
				"RPTB terminal count");
		expect(!(m_cpu->state_int(tms320c54x_device::STATE_ST1) & 0x4000),
				"RPTB terminal state clears ST1.BRAF");
		expect(data.read_word(0x0900) == 0xcccc &&
				data.read_word(0x0901) == 0xaaaa &&
				data.read_word(0x0902) == 0xbbbb,
				"circular addressing wrap order");
		expect(m_cpu->state_int(tms320c54x_device::STATE_AR6) == 0x0802,
				"circular addressing final pointer");
		expect(data.read_word(0x0903) == 0x0000,
				"BITF and conditional return");
		expect(data.read_word(0x0904) == 0xbbbb,
				"absolute data-memory copy");
		expect(data.read_word(0x0905) == 0x0a00,
				"memory-mapped auxiliary-register read");
		expect(m_cpu->state_int(tms320c54x_device::STATE_AR4) == 0xaaaa,
				"memory-mapped auxiliary-register write");
		expect(m_cpu->state_int(tms320c54x_device::STATE_A) == 0x00aa00aa,
				"unsigned data operand load and accumulator XOR shift");
		expect(m_cpu->state_int(tms320c54x_device::STATE_B) == 0xaa00,
				"immediate accumulator mask and rotate");
		expect(m_cpu->space(AS_PROGRAM).read_word(0x0907) == 0xaaaa,
				"data-to-program memory transfer");
		expect(data.read_word(0x0908) == 0xaaaa,
				"program-to-data memory transfer");
		for (unsigned i = 0; i != 26; ++i)
			expect(data.read_word(0x0882 + i) == 0x6000 + i,
					"MVDD dual-operand circular transfer");
		expect(m_cpu->state_int(tms320c54x_device::STATE_AR2) == 0x089c &&
				m_cpu->state_int(tms320c54x_device::STATE_AR3) == 0x131a,
				"MVDD dual-operand address updates");

